app/views/posts/_preview.html.erb

  <li class="post-category">#<%= post.category.name %></li>
  <li class= "post-preview-body"><%= simple_format post.body.first(500) %><%= link_to "Read More", post_path("#{post.id}") %></li>
---
SELECT "posts".* FROM "posts"