app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.reverse

INSERT INTO "posts" ("title", "category_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test Post 3"], ["category_id", 0], ["body", "test test test"], ["created_at", "2015-02-22 17:36:49.485904"], ["updated_at", "2015-02-22 17:36:49.485904"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save